app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "asdas"], ["email", "asdasd"], ["password", "sad"], ["created_at", "2021-04-09 13:58:08.992987"], ["updated_at", "2021-04-09 13:58:08.992987"]]

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "username" = ?, "email" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "aaaaaaaa"], ["email", "ssssssss"], ["password", "rrrrrrr"], ["updated_at", "2021-04-09 13:29:02.865122"], ["id", 4]]